{
  "filename": "1.4.0-release.md",
  "__html": "<h1>Nacos 1.4.0 + Go SDK 1.0.1 Release</h1>\n<p>The annual double eleven shopping festival is coming again.\nHave you grabbed goods you want?</p>\n<p>In this festival, Nacos community will provide a gift for yours -- <code>Nacos 1.4.0</code> and <code>nacos-sdk-go 1.0.1</code> released.</p>\n<h2>Nacos 1.4.0</h2>\n<p>Main upgrade in 1.4.0:</p>\n<ol>\n<li>Refactors the distro protocol of the naming module and sinks to the nacos-core module.</li>\n<li>Used jraft to replace the old self-implemented raft protocol to improve the performance and accuracy of raft semantics.</li>\n<li>Unifies the http clients completely used by nacos, optimizes the usage of some http clients, and reduces connection cost, especially the number of CLOSE_WAIT connections.</li>\n<li>Add a BETA interface to modify service metadata separately.</li>\n<li>Fix some old version bugs and optimized console usage.</li>\n</ol>\n<p>Detail change logs：</p>\n<pre><code>[#1654] Fix content hightlight does not work in config detail page.\n[#2792] Save user information in login when auth open.\n[#2835] Fix the console loading continuously if there is no permission of the namespace.\n[#2866] Fix client do not have permision for api  /nacos/v1/ns/operator/metrics.\n[#3117] Sink and Optimize the Notify implementation into common module.\n[#3192] Unified http client in nacos server.\n[#3315] nacos-client support https.\n[#3397] Fix some error in start script.\n[#3384] Fix raft information show error in console.\n[#3500] Make page list of service manager same as config manager.\n[#3509] Fix address server mode cannot be obtained application.properties.\n[#3518] When binding roles, the user list is changed to the drop-down selection mode.\n[#3530] Add refresh buttons for each page in console.\n[#3533] Change client cache directory config.\n[#3515][#3536][#3899] Upgrade dependency to fix security problem.\n[#3528] Fix client get illegal project.version.\n[#3550] Fix persistency file can't create in server side for raft protocol.\n[#3560] Change title logo in browser.\n[#3566] Extract and sink auth feature to nacos-auth from nacos-config.\n[#3576] Adding the destroy lifecycle method on NamingMaintainService.\n[#3592] Fix incorrect prompt when accessing unauthorized namespace.\n[#3628] Enhance the client update interval when subscribe non-exist service.\n[#3635] Replace raft of naming module by Jraft of consistency module.\n[#3651] Enhance http client usage to reduce CLOSE_WAIT connection in nacos-server.\n[#3661] Enhance raft group update logic for using Jraft.\n[#3671] Move some util class into common package.\n[#3676] Fix revert chunk does not work in Content Comparison page.\n[#3692] Refactor Distro protocol in nacos naming module.\n[#3687] Check serviceName's format in server and client.\n[#3710] Fix service metadata can't be special words problem.\n[#3781] Fix service list intermittently lost service.\n[#3790] Fix the configuration garbled problem that may occur on the client.\n[#3815] Fix client cache may be truncated when contain Chinese.\n[#3833] Fix NotifyCenter will throw NullPointerException when no subscriber.\n[#3855] Add changed detail from previous version in configuration detail page.\n[#3904] Support operate instance's metadata alonely.\n[#3909] Fix nacos server can't config domains.\n[#3973] Fix load config failed during the first run.\n[#4110] Naming modules failed to work properly during the nacos capacity expansion.\n</code></pre>\n<h2>Nacos Go SDK 1.0.1</h2>\n<p>This version mainly fixes some bugs in the old version and support https.</p>\n<p>Detail change logs in <a href=\"https://github.com/nacos-group/nacos-sdk-go/releases/tag/v1.0.1\">release notes</a></p>\n<h2>Community</h2>\n<p>With Nacos 1.4.0 released， Nacos community will invite new two committers : Maijh97 and wangweizZZ.</p>\n<p>They have made a lot of contributions in the unifying http client, sinking the auth module, supporting https in client, reorganizing part of the server thread pool and fixing bugs, and actively participated in community discussions.</p>\n<p>The Nacos community welcomes more partners who would participate to contribution, including but not limited to:</p>\n<ul>\n<li>Source codes</li>\n<li>Document</li>\n<li>Discussion in community</li>\n<li>Multiple-language</li>\n<li>Combination of surrounding ecological products</li>\n</ul>\n<p>Active participation will get exquisite small gifts from the Nacos community~</p>\n<h2>About Nacos</h2>\n<p>Nacos is committed to help you discover, configure, and manage your microservices. It provides a set of simple and useful features enabling you to realize dynamic service discovery, service configuration, service metadata and traffic management.</p>\n<p>Nacos makes it easier and faster to construct, deliver and manage your microservices platform. It is the infrastructure that supports a service-centered modern application architecture with a microservices or cloud-native approach.</p>\n",
  "link": "\\en-us\\blog\\1.4.0-release.html",
  "meta": {
    "title": "Nacos 1.4.0 + Go SDK 1.0.1 Release",
    "keywords": "1.4.0,Go 1.0.1",
    "description": "Nacos 1.4.0 + Go SDK 1.0.1 Release"
  }
}