{
  "filename": "2.0.1-release.md",
  "__html": "<h1>Nacos 2.0.1 + 1.4.2 Release is officially released, with the supporting of the MCP-OVER-XDS protocol</h1>\n<p>Nacos is Alibaba's open source service discovery and configuration management project. The 2.0.1 version released is mainly dedicated to supporting the MCP-OVER-XDS protocol and making the JRaft election more stable.\nThe 1.4.2 version released also greatly enhances the stability of JRaft Leader election.</p>\n<h2>Nacos 2.0.1</h2>\n<p>Main upgrades in 2.0.1:</p>\n<ol>\n<li>Supporting MCP-OVER-XDS protocol in both nacos-istio plug-ins and modules.</li>\n<li>Fixing the stability of the leader election of the JRaft protocol in the k8s environment.</li>\n<li>Fixing the problem of frequently throwing 'Server is Down' error.</li>\n</ol>\n<p>Detail change logs：</p>\n<pre><code>[#3484] Support ldap login.\n[#4856] Support mcp over xds.\n[#5137] Support service list add view subscriber.\n[#5367] Support client encryption plugin for nacos 2.0.\n[#5307] Push support config some parameters\n[#5334] Fix Server is Down problem in k8s environment.\n[#5361] Check isUseGrpcFeatures() when register instance using GRPC protocol.\n[#5486] Refactor Distro Config as singleton and replace GlobalConfig.\n[#5169] Fix instance beat run only by responsible server.\n[#5175] Fix publishConfig lost type.\n[#5178] Fix NPE when init server list failed.\n[#5182] Fix throw NoSuchFieldException in ConfigController when service connect to nacos.\n[#5204] Fix query error when pageNo is larger than service number.\n[#5268] Fix subscriber app unknown\n[#5327] Fix ThreadPool usage problem and add some monitor for distro.\n[#5384] Fix the problem of unable to shutdown NacosConfigService.\n[#5404] Fix frequently udp push for client 1.X.\n[#5419] Fix Nacos 2.0 client auth may invalid for non public namespace.\n[#5442] change state to UP when received status form old version server.\n[#5096] Add unit tests in nacos 2.0.\n[#5171][#5421][#5436][#5450][#5464] Fix IT for nacos 2.0.\n</code></pre>\n<h2>Nacos 1.4.2</h2>\n<ol>\n<li>This version mainly enhances the stability of Leader election in JRAft protocol. It can be used in conjunction with the latest nacos-k8s project to optimize stability to a large extent.</li>\n<li>Moreover, it fixes many bugs in version 1.4.1 such as the prompt about &quot;Server is Down&quot; problems.</li>\n</ol>\n<p>Detail change logs：</p>\n<pre><code>[#4452] Add config compare features.\n[#4602] Add new way for export config.\n[#4996] Make log level changeable for nacos-core module.\n[#5367] Add pre-plugin in client for encrypting config.\n[#3922] Method createServiceIfAbsent in ServiceManager require sync.\n[#4274] skip master-select task when db.num is 1.\n[#4753] Use SafeConstructor to parse yaml configuration.\n[#4762] Naming health check thread num support user define it by self.\n[#4770] Beta publish: change the way of select betaIps, from input to select.\n[#4778] Make SecurityProxy.accessToken threadsafe in single writer multi reader.\n[#4903] Add securuty hint for login page.\n[#4917] Raft ops interface add auth.\n[#4980] Log4J2NacosLogging.loadConfiguration() return directly When location is blank.\n[#5010] Fix the usage of TemplateUtils.\n[#5190] Add some hint log when login failed.\n[#5234] Solve the problem that page can be edited while publishing-config request is processing.\n[#5331] Fix the mouse hovers over the margin in a pointer state and cannot be clicked.\n[#5350] Add hint and detail reason for consistence status Down.\n[#5439] Support specified naming UDP push port for client.\n[#5434] Optimize the ConfigType.isValidType method.\n[#3779] Check groupName can't be empty.\n[#4661] ConfigServletInner#doGetConfig code optimization.\n[#3610] Fix the press F1 to full screen issue in new config page.\n[#3876] Fix push empty service name.\n[#4306] Fix search service by group error problem.\n[#4573,#4629] Jraft leader status check error.\n[#4672] Fix cloning configuration lost description.\n[#4699] Fix metadata batch operation may delete instance problem.\n[#4756] Fix config list sort and search problem.\n[#4787] Losting member if parsing host throw UnknownHostException.\n[#4806] Fix addListener method comment.\n[#4829] Remove instance when distro and raft remove instances data.\n[#4852] Fix main.js is too large problem.\n[#4854] Modify Header to support Keys Ignore Case.\n[#4898] Fix instance list page bug.\n[#4925] Fix member list change will cover member status and metadata problem.\n[#5078] Fix the problem of inconsistent results for querying subscriber list data multiple times.\n[#5026] Fix MetricsHttpAgent metrics twice.\n[#5018] Check group and dataId in groupKey.\n[#5114] ConcurrentHashSet.java is not compatible with jdk1.6 or 1.7.\n[#5253] Fix missing auth identity header error.\n[#5291] Fix Beat task will stop when throw unexpected exception.\n[#5301] Respond all kinds of collections for istio's request.\n[#5351] Fix Consistence status can't switch to UP after Jraft election.\n[#5390] Fix ip verify error.\n[#5427] Fix NPE if Jraft leader is null in CurcuitFilter.\n[#5437] Fix config beta feature will lost dump event problem.\n[#5451] Fix the tag can't be removed problem.\n[#4822][#4823][#4824][#4825][#4979][#5506] Fix dependency security problem.\n[#5277] Subscriber list servername add required.\n[#5380][#5418] Add and enhance unit test.\n</code></pre>\n<h2>Community</h2>\n<p>With Nacos 2.0.1 released， Nacos community has a new committer:</p>\n<p>This committer has made a lot of contributions in promoting multi-data source support, authentication and security, configuration module optimization and improvement, and actively participated in community discussions.</p>\n<p><img src=\"/img/haoyann_commiter.jpg\" alt=\"haoyann_commiter.jpg\"></p>\n<p>The Nacos community welcomes more partners who would participate to contribution, including but not limited to:</p>\n<ul>\n<li>Source codes</li>\n<li>Document</li>\n<li>Discussion in community</li>\n<li>Multiple-language</li>\n<li>Combination of surrounding ecological products</li>\n</ul>\n<p>Active participation will get exquisite small gifts from the Nacos community~</p>\n<h2>About Nacos</h2>\n<p>Nacos is committed to help you discover, configure, and manage your microservices. It provides a set of simple and useful features enabling you to realize dynamic service discovery, service configuration, service metadata and traffic management.</p>\n<p>Nacos makes it easier and faster to construct, deliver and manage your microservices platform. It is the infrastructure that supports a service-centered modern application architecture with a microservices or cloud-native approach.</p>\n",
  "link": "\\en-us\\blog\\2.0.1-release.html",
  "meta": {
    "title": "Nacos 2.0.1 + 1.4.2 Release",
    "keywords": "2.0.1, 1.4.2",
    "description": "Nacos 2.0.1 + 1.4.2 Release"
  }
}