{
  "filename": "activity.md",
  "__html": "<h1>Nacos activity</h1>\n<h2>I. Activity task list</h2>\n<ul>\n<li>Read the official website copy, find the official website bug, and make constructive suggestions for the official website of Chinese and English.</li>\n<li>Read Chinese and English documents, find document bugs, and give suggestions for improving Chinese and English documents (especially pay attention to places where English translation is not good, because English is our own programmers)</li>\n<li>Try the code -&gt; compile and package -&gt; start Nacos server -&gt; stop Nacos server process, propose improvements</li>\n<li>Try to configure and start multi-node Nacos cluster mode tasks, suggestions for improvement</li>\n<li>Try to use the Nacos Java SDK to give suggestions for improvements to the Java SDK</li>\n<li>Try to improve the OpenAPI with the Nacos Open API</li>\n<li>Try to contribute to the contributor process by trying to contribute to the contribution process based on How to Contribute to Nacos Documentation</li>\n<li>Ask Nacos for needs, development plans, ideas and requirements, etc.</li>\n</ul>\n<h2>II. Activity participation method</h2>\n<ul>\n<li>Scan &quot;超哥&quot; WeChat 2 microcode, let &quot;超哥&quot;&quot; help join &quot;Nacos community exchange group&quot;</li>\n</ul>\n<p><img src=\"https://cdn.yuque.com/lark/0/2018/png/11189/1532004866850-5e03b901-6d76-4380-b7bf-66e227808bdc.png\" alt=\"WeChat QR code | left\"></p>\n<ul>\n<li>Select one or more experience tasks in (I)</li>\n<li>After discovering the problem or bug, follow the &quot;Report Report Method&quot; in (III), send a corresponding github issue, and assign it to @github account [xuechaos] (<a href=\"https://github.com/xuechaos\">https://github.com/xuechaos</a>)</li>\n</ul>\n<h2>III. Problem Report Mode</h2>\n<ul>\n<li>Submit questions in the nacos repository at github according to the issues template.</li>\n<li>Code warehouse problem, submit pull request repair, after review, merge into the trunk, it becomes a Contributor.</li>\n<li><a href=\"https://github.com/alibaba/nacos\">https://github.com/alibaba/nacos</a></li>\n<li><a href=\"https://github.com/nacos-group/nacos-group.github.io\">https://github.com/nacos-group/nacos-group.github.io</a></li>\n</ul>\n<h2>IV. Mission Rewards</h2>\n<ul>\n<li>We are customizing some small gifts with Nacos Logo for the small partners who have participated and made outstanding contributions, and will consider the courier to the small partners who have made outstanding contributions in the process.</li>\n<li>The gift is light, but I hope I can express my gratitude for your help.</li>\n<li>Due to limited funds, we can only provide 40 gifts at present, so we limit the number of participants to 40 people, first come first served.</li>\n<li>If you wish, the partner who wishes to receive the gift can send a photo with the gift (can hide the face) for us as a photo material for our community activities.</li>\n</ul>\n<h2>V. Other instructions</h2>\n<ul>\n<li>We are not sure that every proposal will be adopted in the end, but we will try to explain what kind of consideration we are based on, and we did not recommend your proposal.</li>\n<li>Try to report problems by mailing list or report issue instead of reporting on WeChat group to document and facilitate our communication process.</li>\n</ul>\n",
  "link": "\\en-us\\docs\\activity.html",
  "meta": {
    "title": "Nacos activity",
    "keywords": "Nacos,activity",
    "description": "Nacos award activity"
  }
}