{
  "filename": "architecture.md",
  "__html": "<h1>Nacos architecture</h1>\n<h2>Basic Architecture and Concepts</h2>\n<p><img src=\"https://cdn.nlark.com/yuque/0/2019/jpeg/338441/1561217892717-1418fb9b-7faa-4324-87b9-f1740329f564.jpeg\" alt=\"nacos_arch.jpg\"></p>\n<h3>Service</h3>\n<p>A software function or a set of software functions (such as the retrieval of specified information or the execution of a set of operations) with the purpose that different clients can be reused for different purposes (for example, through a cross-process network call). Nacos supports almost all types of services:\n<a href=\"https://kubernetes.io/docs/concepts/services-networking/service/\">Kubernetes Service</a></p>\n<p><a href=\"https://grpc.io/docs/guides/concepts.html#service-definition\">gRPC</a>\n<a href=\"https://dubbo.incubator.apache.org/#/?lang=en-us\"> | Dubbo RPC Service</a></p>\n<p><a href=\"https://spring.io/understanding/REST\">Spring Cloud RESTful Service</a></p>\n<h3>Service Registry</h3>\n<p>The database of services, instances and metadata. Service instances are registered with the service registry on startup and deregistered on shutdown. Clients of the service and/or routers query the service registry to find the available instances of a service. A service registry might invoke a service instances health check API to verify that it is able to handle requests.</p>\n<h3>Service Metadata</h3>\n<p>Data describing services such as service endpoints, service labels, service version, service instance weights, routing rules, security policies.</p>\n<h3>Service Provider</h3>\n<p>A process or application which provides reusable and callable services.</p>\n<h3>Service Consumer</h3>\n<p>A process or application which initiates a call to a service.</p>\n<h3>Configuration</h3>\n<p>During system development, developers usually extract some parameters or variables that need to be changed from the code and manage them in a separate configuration file. This enables the static system artifacts or deliverables (such as WAR and JAR packages) to fit with the physical operating environment in a better way. Configuration management is generally a part of system deployment, which is executed by the administrator or operation and maintenance personnel. Configuration modification is an effective method to adjust the behavior of a running system.</p>\n<h3>Configuration Management</h3>\n<p>In the data center, all configuration-related activities such as editing, storage, distribution, change management, history version management, and change audit are collectively referred to as configuration management.</p>\n<h3>Naming Service</h3>\n<p>Mapping the &quot;names&quot; of all the objects and entities in the distributed system to the associated metadata, for example, <code>ServiceName</code> -&gt; <code>Endpoints\\Version etc...</code>, <code>Distributed Lock Name</code> -&gt; <code>Lock Owner/Status Info</code>, <code>DNS Domain Name</code> -&gt; <code>IP List</code>. Service discovery and DNS are the two major scenarios of naming service.</p>\n<h3>Configuration Service</h3>\n<p>Providing dynamic configuration, service metadata and configuration management for other services or application.</p>\n<h3><a href=\"./concepts.md\">More concepts...</a></h3>\n<h2>Introduction to logical architecture and its components</h2>\n<p><img src=\"https://cdn.nlark.com/yuque/0/2019/png/338441/1561217775318-6e408805-18bb-4242-b4e9-83c5b929b469.png\" alt=\"nacos-logic.jpg\"></p>\n<ul>\n<li>Service Management: Implement services CRUD, domain name CRUD, service health check, service weight management, etc.</li>\n<li>Configuration Management: Implement configuration CRUD, version management, grayscale management, monitoring management, push trajectory, aggregate data, etc.</li>\n<li>Metadata Management: Provides metadata CURD and marking capabilities</li>\n<li>Plug-in mechanism: implements three modules to share the ability to implement the extended point SPI mechanism</li>\n<li>Event mechanism: implement asynchronous event notification, sdk data change asynchronous notification and other logic</li>\n<li>Log module: Manage log classification, log level, log portability (especially to avoid conflicts), log format, exception code + help documentation</li>\n<li>Callback mechanism: sdk informs the data and calls back user processing through a unified mode. Interface and data structures need to be scalable</li>\n<li>Addressing mode: solve various addressing modes such as ip, domain name, nameserver, broadcast, etc., need to be expandable</li>\n<li>Push channel: solve the push performance problem between server and storage, server, server and sdk</li>\n<li>Capacity management: manage each tenant, the capacity under the group, prevent the storage from being blasted, affecting service availability</li>\n<li>Traffic management: control the request frequency, the number of long links, the size of the message, and request flow control according to multiple dimensions such as tenant and group.</li>\n<li>Caching mechanism: disaster recovery directory, local cache, server cache mechanism. Disaster recovery catalogue requires tools</li>\n<li>Startup mode: Start different programs + UI according to stand-alone mode, configuration mode, service mode, dns mode, or all mode</li>\n<li>Consistency Protocol: Resolve different data, different consistency requirements, different consistency mechanisms</li>\n<li>Storage module: solve data persistence, non-persistent storage, solve data fragmentation problem</li>\n<li>Nameserver: Resolve the routing problem from namespace to clusterid, solve the mapping problem between user environment and nacos physical environment</li>\n<li>CMDB: Solve the metadata storage, docking problems with the three-party cmdb system, solving applications, people, resource relationships</li>\n<li>Metrics: Exposes standard metrics data for easy access to three-way monitoring systems</li>\n<li>Trace: Exposure standard trace, easy to open with SLA system, log whitening, push trajectory, etc., and can be connected with metering and billing system</li>\n<li>Access management: equivalent to Ali cloud service, assign identity, capacity, authority process</li>\n<li>User Management: Resolve issues such as user management, login, sso, etc.</li>\n<li>Rights Management: Resolve issues such as identity, access control, role management, etc.</li>\n<li>Audit system: extended interface facilitates access to different company audit systems</li>\n<li>Notification system: Core data changes, or operations, facilitated through the SMS system, notify the corresponding person data changes</li>\n<li>OpenAPI: exposes the standard Rest style HTTP interface, easy to use, and easy for multi-language integration</li>\n<li>Console: easy to use console, do service management, configuration management, etc.</li>\n<li>SDK: Multilingual sdk</li>\n<li>Agent: dns-f similar mode, or integration with mesh and other programs</li>\n<li>CLI: Lightweight management of the product on the command line, as easy as git</li>\n</ul>\n<h2>Domain Model</h2>\n<h3>Data Model</h3>\n<p>The Nacos data model Key is uniquely determined by the triplet. The Namespace defaults to an empty string, the public namespace (public), and the group defaults to DEFAULT_GROUP.</p>\n<p><img src=\"https://cdn.nlark.com/yuque/0/2019/jpeg/338441/1561217857314-95ab332c-acfb-40b2-957a-aae26c2b5d71.jpeg\" alt=\"nacos_data_model\"></p>\n<h3>Service Entity Relationship Model</h3>\n<p><img src=\"https://cdn.nlark.com/yuque/0/2019/jpeg/338441/1561217924697-ba504a35-129f-4fc6-b0df-1130b995375a.jpeg\" alt=\"nacos_naming_data_model\"></p>\n<h3>Config Entity Relationship Model</h3>\n<p>Around the configuration, there are mainly two associated entities, one is the configuration change history, and the other is the service tag (used for marking classification, convenient for indexing), which is associated by ID.</p>\n<p><img src=\"https://cdn.nlark.com/yuque/0/2019/jpeg/338441/1561217958896-4465757f-f588-4797-9c90-a76e604fabb4.jpeg\" alt=\"nacos_config_er\"></p>\n<h2>Class view</h2>\n<h3>Nacos-SDK Class view</h3>\n<p>// TODO Service part to be continued</p>\n<p><img src=\"https://cdn.nlark.com/yuque/0/2019/jpeg/338441/1561218077514-bfa98d03-88a1-43b9-b014-1491406e3db7.jpeg\" alt=\"nacos_sdk_class_relation\"></p>\n<h2>Artifacts, Deployment, and Start Mode</h2>\n<p><img src=\"https://cdn.yuque.com/lark/0/2018/png/15914/1531730742844-e8325932-258b-49b2-9473-8d1199efe20d.png\" alt=\"undefined\"></p>\n<h3>Two Artifacts</h3>\n<p>Nacos supports both standard Docker images (v0.2.0) and nacos-.zip(tar.gz). You can choose the appropriate build to deploy the Nacos service according to your needs.</p>\n<h3>Two Start Modes</h3>\n<p>Nacos supports two start modes. you can merging the Service Registry and the Config Center in one process or deploying them in separately cluster.</p>\n<h3>Free Public Cloud Service on Alibaba Cloud</h3>\n<p>In addition to deploying and launching Nacos services by users themselves, Nacos also supports public cloud. Nacos public cloud service will be free in Alibaba Cloud's commercial service (such as <a href=\"https://www.aliyun.com/product/acm\">ACM</a>, <a href=\"https://www.aliyun.com/product/edas\">EDAS</a>). We also welcome other public cloud providers to offer Nacos public cloud services.</p>\n",
  "link": "\\en-us\\docs\\architecture.html",
  "meta": {
    "title": "Nacos architecture",
    "keywords": "Nacos,architecture",
    "description": "Nacos architecture"
  }
}