{
  "filename": "contributing.md",
  "__html": "<h2>How to Contribute</h2>\n<p>Nacos is released under the non-restrictive Apache 2.0 license, and follows a very standard Github development process, using Github tracker for issues and merging pull requests into master. If you want to contribute even something trivial, please do not hesitate, but follow the guidelines below.</p>\n<p>We are always very happy to have contributions, whether for trivial cleanups or big new features.\nWe want to have high quality, well documented codes for each programming language.</p>\n<p>Nor is code the only way to contribute to the project. We strongly value documentation, integration with other project, and gladly accept improvements for these aspects.</p>\n<h3>Contact</h3>\n<h4>Gitter</h4>\n<p><a href=\"https://gitter.im/alibaba/nacos\">https://gitter.im/alibaba/nacos</a></p>\n<h4>Mailing list</h4>\n<p>Mailing list is recommended for discussing almost anything related to Nacos. Please refer to this <a href=\"https://github.com/apache/incubator-dubbo/wiki/Mailing-list-subscription-guide\">guide</a> for detailed documentation on how to subscribe to mailing lists.</p>\n<ul>\n<li>\n<p><a href=\"mailto:dev-nacos%2Bsubcribe@googlegroups.com\">dev-nacos@googlegroups.com</a>: The develop mailing list. You can ask questions here if you encounter any problem when using or developing Nacos.</p>\n</li>\n<li>\n<p><a href=\"mailto:commits-nacos%2Bsubcribe@googlegroups.com\">commits-nacos@googlegroups.com</a>: All commits will be sent to this mailing list. You can subscribe to it if you are interested in Nacos's development.</p>\n</li>\n<li>\n<p><a href=\"mailto:users-nacos%2Bsubcribe@googlegroups.com\">users-nacos@googlegroups.com</a>: All  Github <a href=\"https://github.com/alibaba/nacos/issues\">issues</a> updates and <a href=\"https://github.com/alibaba/nacos/pulls\">pull request</a> updates will be sent to this mailing list.</p>\n</li>\n<li>\n<p>If you have any questions, please contact <a href=\"mailto:nacos_dev@linux.alibaba.com\">nacos_dev@linux.alibaba.com</a>.</p>\n</li>\n</ul>\n<h2>Contribution flow</h2>\n<p>This is a rough outline of what a contributor's workflow looks like:</p>\n<ul>\n<li>Fork the current repository.</li>\n<li>Create a topic branch from where to base the contribution. This is usually the master branch.</li>\n<li>Make commits of logical units.</li>\n<li>Make sure commit messages are in the proper format (see below).</li>\n<li>Push changes in a topic branch to your forked repository.</li>\n<li>Follow the checklist in the <a href=\"https://lark.alipay.com/nacos/nacosdocs/askodu\">pull request template</a></li>\n<li>Before you send the pull request, please sync your forked repository with remote repository. This will make your pull request simple and clear. See guide below:</li>\n</ul>\n<pre><code>git remote add upstream git@github.com:alibaba/nacos.git\ngit fetch upstream\ngit rebase upstream/master\ngit checkout -b your_awesome_patch\n... add some work\ngit push origin your_awesome_patch\n</code></pre>\n<ul>\n<li>Submit a pull request to alibaba/nacos and wait for reply.</li>\n</ul>\n<p>Thanks for contributing!</p>\n<h2>Contributing Code</h2>\n<p>To submit a change for inclusion, please do the following:</p>\n<h4>If the change is non-trivial, please include unit tests that cover the new functionality.</h4>\n<h4>If you are introducing a completely new feature or API, it is a good idea to start a wiki and get consensus on the basic design first.</h4>\n<h4>It is our job to follow up on patches in a timely fashion. Nag us if we aren't doing our job (sometimes we drop things).</h4>\n<h2>Becoming a Committer</h2>\n<p>We are always interested in adding new contributors. What we look for are series of contributions, good taste and ongoing interest in the project. If you are interested in becoming a committer, please let one of the existing committers know and they can help you walk through the process.</p>\n<p>Nowadays, we have several important contribution points:</p>\n<h4>Wiki &amp; JavaDoc</h4>\n<h4>Nacos Console</h4>\n<h4>Nacos SDK(<a href=\"http://C++.Net\">C++.Net</a>\\PHP\\Python\\Go\\Node.js)</h4>\n<h5>Prerequisites</h5>\n<p>If you want to contribute to the above listing points, you must abide by the prerequisites listed below.</p>\n<h6>Readability - APIs as well as important methods must have Javadoc.</h6>\n<h6>Testability - Ensure over 80% unit test coverage for main processes.</h6>\n<h6>Maintainability - Comply with our <a href=\"style/codeStyle.xml\">PMD spec</a>, with an update frequency at least once every 3 months.</h6>\n<h6>Deployability - We encourage you to deploy into <a href=\"http://search.maven.org/\">maven repository</a>.</h6>\n"
}