{
  "filename": "contributing-flow.md",
  "__html": "<h1>Nacos Contributing Flow</h1>\n<p>This contribution flow is applicable to all Nacos community content, including but not limited to <code>Nacos</code>, <code>Nacos wiki/doc</code>, <code>Nacos SDK</code>.</p>\n<p>The following use contributing <code>Nacos</code> as an example to explain the contribution flow in detail.</p>\n<h2>1. Fork Alibaba/Nacos repository to your Github.</h2>\n<h2>2. Clone your fork Nacos repository to local.</h2>\n<pre><code>git clone ${your fork nacos repo address}\n\ncd nacos\n</code></pre>\n<h2>3. Add Alibaba/Nacos repository as upstream repo.</h2>\n<pre><code>git remote add upstream https://github.com/alibaba/nacos.git\n\ngit remote -v \n\n    origin\t   ${your fork nacos repo address} (fetch)\n    origin\t   ${your fork nacos repo address} (push)\n    upstream\thttps://github.com/alibaba/nacos.git (fetch)\n    upstream\thttps://github.com/alibaba/nacos.git (push)\n    \ngit fetch origin\ngit fetch upstream\n</code></pre>\n<h2>4. Choose a basic branch of development usually upstream/develop,and create a new branch based on it.</h2>\n<pre><code>(checkout branch from remote repo to local）\ngit checkout -b upstream-develop upstream/develop\n\n(Create a development branch from the local branch, usually using the issue number as the development branch name）\ngit checkout -b develop-issue#${issue-number}\n\n</code></pre>\n<h2>5. Do your change in your local develop branch.</h2>\n<p>First please make sure you read and set the <code>Nacos code style</code> correctly, please read the related content <a href=\"https://github.com/alibaba/nacos/blob/develop/style/codeStyle.md\">Code of Conduct</a>.</p>\n<p>When making changes, please ensure that the changes on this branch are <strong>only relevant to the issue</strong>, and try to be as small as possible, so that <strong>only one thing is modified in one branch, and only one thing is modified in one PR</strong>.</p>\n<p>At the same time, please use your English description as much as possible for your commits. It is mainly described by <strong>predicate + object</strong>, such as: <code>Fix xxx problem/bug</code>.</p>\n<p>Some simple commits can be described using <code>For xxx</code>, such as: <code>For codestyle</code>.</p>\n<p>If the commits is related to an ISSUE, you can add the ISSUE number as a prefix, such as: <code>For #10000, Fix xxx problem/bug</code>.</p>\n<h2>6. Rebase develop branch</h2>\n<p>When you make changes, other people's changes may have commited and merged. At this time, there may be conflicts. Please use the rebase command to merge and resolve. There are two main benefits:</p>\n<ol>\n<li>Your submission record will be very clean, without the words <code>Merge xxxx branch</code>.</li>\n<li>After rebase, the commit log of your branch is also a single chain, it is easier to check back.</li>\n</ol>\n<pre><code>git fetch upstream\n\ngit rebase -i upstream/develop\n\n</code></pre>\n<p>OR</p>\n<pre><code>git checkout upstream-develop\ngit pull \ngit checkout develop-issue#${issue-number}\ngit rebase -i upstream-develop\n</code></pre>\n<p><strong>If you are using Intellij IDEA</strong>, it is recommended to use the IDE version control, which has a more convenient visual panel to resolve conflicts and squash operations.</p>\n<h2>7. Push your develop branch to your fork repository.</h2>\n<pre><code>git push origin develop-issue#${issue-number}\n</code></pre>\n<h2>8. Create Pull Request according to the pull request template</h2>\n<p><a href=\"https://nacos.io/en-us/docs/pull-request.html\">pull request template</a></p>\n<p>The Nacos community will review your Pull Request and may propose comments.</p>\n<p>You can return to step 5 to modify code according to the comments and use step 6 to resubmit.</p>\n<p><strong>If you are prompted that there are conflicts when you push to fork repo again, Force push to your fork branch will be ok.</strong> The reason of conflicts is that the commit ID has changed after you rebase with others changes.</p>\n<h2>9. If no more problem, Nacos community will merge your PR. Congratulations for you becoming a official contributor of Nacos.</h2>\n",
  "link": "\\en-us\\docs\\contributing-flow.html",
  "meta": {
    "title": "Contributing Flow",
    "keywords": "Contributing,Source Code",
    "description": "This contribution flow is applicable to all Nacos community content, including but not limited to Nacos, Nacos wiki/doc, Nacos SDK."
  }
}