{
  "filename": "namespace-endpoint-best-practices.md",
  "__html": "<h1>Namespace, endpoint best practices</h1>\n<p>With using Nacos enterprises more and more, the two most frequently encountered problem is: how to use in my production environment right namespace and the endpoint.</p>\n<h2>namespce</h2>\n<p>Regarding the namespace, the following main from <strong>namespace design background</strong> and <strong>namespace best practice</strong> two aspects to discuss.</p>\n<h3>namespace design background</h3>\n<p>Namespace design is made more nacos based on this environment and multi-tenant data (<strong>configuration and service</strong>) of isolation.That is:</p>\n<ul>\n<li>From the point of view of a tenant (user), if there are many different environment, so this time can be specified according to the environment to create different namespce, in order to realize the environment isolation.For example, you might be everyday, pretest and the production of three different environment, then use a nacos cluster can build the following three different namespace. As shown in the figure below:</li>\n</ul>\n<p><img src=\"http://edas.oss-cn-hangzhou.aliyuncs.com/deshao/pictures/nacos_ingle_tenant_namespace.jpg\" alt=\"\"></p>\n<ul>\n<li>from the point of view of multiple tenants (user), each tenant (user) may have its own namespace, each tenant configuration data (user) and registered service data belonging to its own namespace, so as to achieve the multi-tenant isolation between the data.For example the supervisor assigned three tenants, San Zhang, Si Li and Wu Wang respectively.Distribution of good, after all the tenants on their own account name and password after logging in, create your own namespace. As shown in the figure below:</li>\n</ul>\n<p><img src=\"http://edas.oss-cn-hangzhou.aliyuncs.com/deshao/pictures/nacos_multi_tenant_namespace.jpg\" alt=\"\"></p>\n<p><strong>Note:</strong> This feature is still in planning.</p>\n<h3>namespace best practices</h3>\n<p>Best practices on the namespace, this part mainly consists of two actions:</p>\n<ul>\n<li>How to obtain the value of the namespace</li>\n<li>The namespace parameters initialization method</li>\n</ul>\n<h3>How to obtain the value of the namespace</h3>\n<p>Whether you are based on Spring Cloud or Dubbo to use nacos, involve namespace parameter input, so when the value of the namespace from where can I get?</p>\n<ol>\n<li>\n<p>If you are using is not aware to this parameter in the process of input, then nacos unified will use a default namespace as input, nacos naming will use <strong>public</strong> as the default parameters to initialize, nacos config will use an <strong>empty string</strong> as the default parameters to initialize.</p>\n</li>\n<li>\n<p>If you need to customize your own namespace, then the value how to produce?</p>\n<p>Can see on the console function of the left side of the nacos has the function of a <strong>namespace</strong>, click on the <strong>new namespace</strong> can see button, so this time you can create your own namespace.Create success, generates a <strong>namespace ID</strong>, is mainly used to avoid <strong>namespace name</strong> namesake, is likely to happen. So when you need to configure the specified namespace in the application, <strong>fill in it is the namespace ID</strong>.The important things three times:</p>\n<ol>\n<li>When you need to configure the specified namespace in the application, <strong>fill in it isthe namespace ID</strong>.</li>\n<li>When you need to configure the specified namespace in the application, <strong>fill in it isthe namespace ID</strong>.</li>\n<li>When you need to configure the specified namespace in the application, <strong>fill in it isthe namespace ID</strong>.</li>\n</ol>\n</li>\n</ol>\n<p>Namesace for <strong>public</strong> is nacos a retain control, if you need to create your own namespace, it is best not to <strong>public</strong> and name repetition, to an actual business scenarios have specific semantic named after, lest bring literally a namespace which is not easy to distinguish himself.</p>\n<h3>namespace parameters initialization method</h3>\n<p>Nacos client for namespace initialization process as shown in the figure below:</p>\n<p><img src=\"http://edas.oss-cn-hangzhou.aliyuncs.com/deshao/pictures/nacos_init_namespace_plus.jpg\" alt=\"\"></p>\n<p>Nacos client initialization of the namespace contains two main parts:</p>\n<ul>\n<li>\n<p>User mode by nacos client through the properties in the instance structure parameters was introduced into the namespace.</p>\n</li>\n<li>\n<p>In a cloud environment (<strong>Alibaba cloud of EDAS</strong>) of the namespace argument parsing.</p>\n<p>By <strong>-Duse.cloud.namespace.parsing=true/false</strong> whether you need to control in a cloud environment automatic parsing namespace parameter, the default value is <strong>true</strong>, is automatically parsed, its purpose is convenient when the user on the cloud can be smooth on the cloud in the form of zero cost.If the user on the cloud under the need to use the self-built nacos namespace, that this time you only need to <strong>-Duse.cloud.namespace.parsing=false</strong>.</p>\n</li>\n</ul>\n<h2>endpoint</h2>\n<p>On the endpoint, and mainly from the <strong>the design background of endpoint</strong> and <strong>the endpoint parameters initialization</strong> two aspects to discuss.</p>\n<h3>The design background of endpoint</h3>\n<p>When nacos server cluster needs to enlarge shrinks, let a client needs to have a kind of ability can timely change perception to the cluster. In a timely manner to perceive the change of the cluster is realized through the endpoint.That the client will be timed to the endpoint sends a request to update the client list in memory clusters.</p>\n<h3>The endpoint of the initialization parameter</h3>\n<p>Nacos Client provides an endpoint of the incoming parameter rules make sense of it.When through the constructor to initialize the <strong>properties</strong> the endpoint, the specified endpoint value can be a specific value, also can be in the form of a placeholder, as shown below:</p>\n<blockquote>\n<p><strong>${endpoint.options:defaultValue}</strong>。</p>\n</blockquote>\n<p>Description:</p>\n<ol>\n<li><strong>endpoint.options</strong> is a specific variable.Support from the system property, reads the system environment variables.</li>\n<li><strong>defaultValue</strong> is given a default value.When is not properly initialized from the specific variables, the given default value is used to initialize.</li>\n</ol>\n<p>The endpoint of the parsing rules is more complex, the overall flow chart of a parse is as follows:</p>\n<p><img src=\"http://edas.oss-cn-hangzhou.aliyuncs.com/deshao/pictures/nacos_init_endpoint.jpg\" alt=\"\"></p>\n<p><strong>Description:</strong> Blue special distinction is to support a cloud environment (Alibaba cloud EDAS) automatically from the system environment variables to read in the endpoint value, in order to achieve the user local development or moving applications to the cloud with zero cost on the way to achieve a smooth of cloud.</p>\n<p>Description:</p>\n<ul>\n<li>\n<p>Open the endpoint parameters parsing rules</p>\n<ol>\n<li>\n<p>If the initialization Nacos Client, not through the properties to specify the endpoint, this time from the system environment variables in called <strong>ALIBABA_ALIWARE_ENDPOINT_URL</strong> to initialize the specified value, if the system environment variable is not set, so this time will return an empty string.</p>\n</li>\n<li>\n<p>If set the endpoint,</p>\n<ol>\n<li>\n<p>Set the endpoint is a specific value specified.</p>\n<p>At this time will be from the system environment variables in the variables called <strong>ALIBABA_ALIWARE_ENDPOINT_URL</strong> to initialize the specified value, if the system environment variables not set, so this time use user mode was introduced into the specific value to initialize the endpoint.</p>\n</li>\n<li>\n<p>Input in the form of a placeholder.</p>\n<p>Then parses the concrete placeholder value, then:</p>\n<ol>\n<li>\n<p>In order to value from the system properties and environment variables.</p>\n<p>For example,You input is <strong>${nacos.endpoint:defaultValue}</strong>, then parse out a placeholder is <strong>nacos.endpoint</strong>. Parsing comes out, can read first in the System properties (<strong>System.getProperty(&quot;nacos.endpoint&quot;)</strong>) is set up <strong>nacos endpoint</strong> variable values, if not, will be called from the System environment variables in the variables specified <strong>nacos.endpoint</strong> value to initialize.</p>\n</li>\n<li>\n<p>If by parsing out a placeholder is not properly initialized the endpoint, is from the system environment variables in called <strong>ALIBABA_ALIWARE_ENDPOINT_URL</strong> to initialize the specified value.</p>\n</li>\n<li>\n<p>If after the above two steps have not been initialized, then if you set the default value, this time will use the default value to initialize the endpoint, otherwise returned to parse out a placeholder.</p>\n</li>\n</ol>\n</li>\n</ol>\n</li>\n</ol>\n</li>\n<li>\n<p>Close the endpoint parameter parsing rules</p>\n<p>When closed the endpoint parameter parsing rules, this time is in user mode in constructing Nacos Client through the properties parameter input values of the endpoint.</p>\n</li>\n</ul>\n<p>By default, Nacos Client is the ability to open the endpoint parameter parsing rules. If you want to close the ability, can be in Nacos Client initialization when the incoming instances of the properties specified in the key to <strong>isUseEndpointParsingRule</strong>, <strong>false</strong> value is can be closed.</p>\n",
  "link": "/en-us/docs/namespace-endpoint-best-practices.html",
  "meta": {
    "title": "Namespace,endpoint best practices",
    "keywords": "namespace,endpoint,best practices",
    "description": "With using Nacos enterprises more and more,the two most frequently encountered problem is:how to use in my production environment right namespace and the endpoint."
  }
}