{
  "filename": "what-is-nacos.md",
  "__html": "<h1>What is Nacos</h1>\n<h2>Overview</h2>\n<p>Welcome to Nacos!</p>\n<p>Nacos is committed to help you discover, configure, and manage your microservices. It provides a set of simple and useful features enabling you to realize dynamic service discovery, service configuration, service metadata and traffic management.</p>\n<p>Nacos makes it easier and faster to construct, deliver and manage your microservices platform. It is the infrastructure that supports a service-centered modern application architecture with a microservices or cloud-native approach.</p>\n<h2>What is Nacos？</h2>\n<p>Service is a first-class citizen in Nacos. Nacos supports discovering, configuring, and managing almost all types of services:</p>\n<p><a href=\"https://kubernetes.io/docs/concepts/services-networking/service/\">Kubernetes Service</a></p>\n<p><a href=\"https://grpc.io/docs/guides/concepts.html#service-definition\">gRPC</a> &amp; <a href=\"https://dubbo.incubator.apache.org\">Dubbo RPC Service</a></p>\n<p><a href=\"https://spring.io/understanding/REST\">Spring Cloud RESTful Service</a></p>\n<p>Key features of Nacos:</p>\n<ul>\n<li>\n<p><strong>Service Discovery And Service Health Check</strong></p>\n<p>Nacos supports both DNS-based and RPC-based (Dubbo/gRPC) service discovery. After a service provider registers a service with <a href=\"./sdk.md\">native</a>, <a href=\"./open-api.md\">OpenAPI</a>, or <a href=\"./other-language.md\">a dedicated agent</a>, a consumer can discover the service with either <a href=\"./other-language.md\">DNS</a> or <a href=\"./open-api.md\">HTTP</a>.</p>\n<p>Nacos provides real-time health check to prevent services from sending requests to unhealthy hosts or service instances. Nacos supports both transport layer (PING or TCP) health check and application layer (such as HTTP, Redis, MySQL, and user-defined protocol) health check. For the health check of complex clouds and network topologies(such as VPC, Edge Service etc), Nacos provides both agent mode and server mode health check. Nacos also provide a unity service health dashboard to help you manage the availability and traffic of services.</p>\n</li>\n<li>\n<p><strong>Dynamic configuration management</strong></p>\n<p>Dynamic configuration service allows you to manage the configuration of all applications and services in a centralized, externalized and dynamic manner across all environments.</p>\n<p>Dynamic configuration eliminates the need to redeploy applications and services when configurations are updated.</p>\n<p>Centralized management of configuration makes it more convenient for you to achieve stateless services and elastic expansion of service instances on-demand.</p>\n<p>Nacos provides an easy-to-use UI (<a href=\"http://console.nacos.io/nacos/index.html\">DEMO</a>) to help you manage all of your application or services's configurations. It provides some out-of-box features including configuration version tracking, canary/beta release, configuration rollback, and client configuration update status tracking to ensure the safety and control the risk of configuration change.</p>\n</li>\n<li>\n<p><strong>Dynamic DNS service</strong></p>\n<p>Dynamic DNS service which supports weighted routing makes it easier for you to implement mid-tier load balancing, flexible routing policies, traffic control, and simple DNS resolution services in your production environment within your data center. Dynamic DNS service makes it easier for you to implement DNS-based Service discovery.</p>\n<p>Nacos provides some simple <a href=\"xx\">DNS APIs TODO</a> for you to manage your DNS domain names and IPs.</p>\n</li>\n<li>\n<p><strong>Service governance and metadata management</strong></p>\n<p>Nacos allows you to manage all of your services and metadata from the perspective of a microservices platform builder. This includes managing service description, life cycle, service static dependencies analysis, service health status, service traffic management，routing and security rules, service SLA, and first line metrics.</p>\n</li>\n<li>\n<p><a href=\"./roadmap.md\">Check more features ...</a></p>\n</li>\n</ul>\n<h2>Nacos Map</h2>\n<p>A picture to understand Nacos, the following structure will be described in detail.</p>\n<p>// TODO this picture need to translate.</p>\n<p><img src=\"/img/nacosMap.jpg\" alt=\"nacos_map\"></p>\n<ul>\n<li>Large picture of characteristics: To introduce the characteristics of the problem domain we want to solve from the functional characteristics and non-functional characteristics.</li>\n<li>Larger architecture: Get a quick entry into the Nacos world with a clear architecture</li>\n<li>Business picture: Business scenarios that can be supported with current features, and best practices</li>\n<li>Big picture of the ecology: systematically sorting out the relationship between Nacos and mainstream technology ecology</li>\n<li>Big picture of advantage: showcase Nacos core competitiveness</li>\n<li>Strategic picture: Nacos's macro advantage from strategic to tactical level</li>\n</ul>\n<h2>Nacos landscape</h2>\n<p><img src=\"https://cdn.nlark.com/lark/0/2018/png/11189/1533045871534-e64b8031-008c-4dfc-b6e8-12a597a003fb.png\" alt=\"nacos_landscape.png\"></p>\n<p>As the figure above shows, Nacos seamlessly supports open source ecologies including <a href=\"./use-nacos-with-dubbo.md\">Dubbo and Dubbo Mesh</a>, <a href=\"./use-nacos-with-springcloud.md\">Spring Cloud</a>, and <a href=\"./use-nacos-with-kubernetes.md\">Kubernetes and CNCF</a>.</p>\n<p>Use Nacos to simplify your solutions in service discovery, configuration management, and service governance and management. With Nacos, microservices management in open source system is easy.</p>\n<p>For more information about how to use Nacos with other open source projects, see the following:</p>\n<p><a href=\"./use-nacos-with-kubernetes.md\">Use Nacos with Kubernetes</a></p>\n<p><a href=\"./use-nacos-with-dubbo.md\">Use Nacos with Dubbo</a></p>\n<p><a href=\"./roadmap.md\">Use Nacos with gRPC</a></p>\n<p><a href=\"./use-nacos-with-springcloud.md\">Use Nacos with Spring Cloud</a></p>\n<p><a href=\"./use-nacos-with-istio.md\">Use Nacos with Istio</a></p>\n<h2>What’s next</h2>\n<p>Continue with <a href=\"./quick-start.md\">quick start</a> to get started with Nacos.</p>\n",
  "link": "\\en-us\\docs\\what-is-nacos.html",
  "meta": {
    "title": "What is Nacos",
    "keywords": "nacos",
    "description": "What is Nacos"
  }
}